#### Terraform Plan Output 

```
random_string.legacy_id: Refreshing state... [id=vhvg8z]
random_string.public_id: Refreshing state... [id=8p8ia2]
random_string.iam_id: Refreshing state... [id=mc0f2k]
data.archive_file.lambda: Reading...
data.archive_file.attacker_zip: Reading...
random_string.rand_id: Refreshing state... [id=mpn9cb]
random_string.secure_id: Refreshing state... [id=9r3207]
data.archive_file.attacker_zip: Read complete after 0s [id=e2074b6c46b0a6e5a1edcf7b0b1a29715f3ae265]
data.archive_file.lambda: Read complete after 0s [id=3bda9e42e6d5b7a022c318f745578ac50ccee9a8]
aws_s3_bucket_logging.legacy_logging_config: Refreshing state... [id=cyb611-insecure-no-encryption-vhvg8z]
aws_s3_bucket_server_side_encryption_configuration.legacy_enc: Refreshing state... [id=cyb611-insecure-no-encryption-vhvg8z]
aws_s3_bucket_versioning.legacy_versioning: Refreshing state... [id=cyb611-insecure-no-encryption-vhvg8z]
aws_s3_object.iam_config: Refreshing state... [id=sensitive_data/mock_pii.csv]
aws_s3_bucket.legacy_data: Refreshing state... [id=cyb611-insecure-no-encryption-vhvg8z]
aws_s3_bucket.legacy_logs: Refreshing state... [id=cyb611-insecure-no-encryption-logs-vhvg8z]
aws_s3_object.web_asset: Refreshing state... [id=sensitive_data/mock_pii.csv]
aws_s3_bucket_server_side_encryption_configuration.public_enc: Refreshing state... [id=cyb611-insecure-public-rw-8p8ia2]
aws_s3_bucket_ownership_controls.legacy_ownership: Refreshing state... [id=cyb611-insecure-no-encryption-vhvg8z]
aws_s3_bucket.public_assets: Refreshing state... [id=cyb611-insecure-public-rw-8p8ia2]
aws_s3_bucket_public_access_block.legacy_block: Refreshing state... [id=cyb611-insecure-no-encryption-vhvg8z]
aws_s3_bucket_policy.legacy_ssl_policy: Refreshing state... [id=cyb611-insecure-no-encryption-vhvg8z]
aws_s3_bucket_ownership_controls.legacy_log_ownership: Refreshing state... [id=cyb611-insecure-no-encryption-logs-vhvg8z]
aws_s3_bucket_logging.public_logging_config: Refreshing state... [id=cyb611-insecure-public-rw-8p8ia2]
aws_s3_bucket_acl.legacy_log_acl: Refreshing state... [id=cyb611-insecure-no-encryption-logs-vhvg8z,log-delivery-write]
aws_s3_bucket_server_side_encryption_configuration.iam_enc: Refreshing state... [id=cyb611-insecure-iam-mc0f2k]
aws_s3_object.archive_file: Refreshing state... [id=sensitive_data/mock_pii.csv]
aws_s3_bucket.public_logs: Refreshing state... [id=cyb611-insecure-public-rw-logs-8p8ia2]
aws_iam_role.scanner: Refreshing state... [id=S3ScannerRole]
aws_s3_bucket.iam_logs: Refreshing state... [id=cyb611-insecure-iam-logs-mc0f2k]
data.aws_caller_identity.current: Reading...
aws_iam_role.attacker_role: Refreshing state... [id=S3RedTeamRole]
data.aws_caller_identity.current: Read complete after 0s [id=151462990345]
aws_s3_bucket.iam_bucket: Refreshing state... [id=cyb611-insecure-iam-mc0f2k]
aws_s3_bucket.main_bucket: Refreshing state... [id=cyb611-insecure-misconfigured-mpn9cb]
aws_s3_bucket.secure_storage: Refreshing state... [id=cyb611-secure-9r3207]
aws_s3_bucket.trail_bucket: Refreshing state... [id=cyb611-cloudtrail-logs-phish-bits-12345]
aws_s3_bucket.access_logs: Refreshing state... [id=cyb611-secure-logs-9r3207]
aws_s3_bucket_versioning.public_versioning: Refreshing state... [id=cyb611-insecure-public-rw-8p8ia2]
aws_s3_bucket_public_access_block.public_block: Refreshing state... [id=cyb611-insecure-public-rw-8p8ia2]
aws_s3_bucket_ownership_controls.public_ownership: Refreshing state... [id=cyb611-insecure-public-rw-8p8ia2]
aws_iam_role_policy.scanner: Refreshing state... [id=S3ScannerRole:S3ScannerPolicy]
aws_lambda_function.scanner: Refreshing state... [id=S3SecurityScanner]
aws_iam_role_policy.attacker_policy: Refreshing state... [id=S3RedTeamRole:S3RedTeamPolicy]
aws_lambda_function.attacker_lambda: Refreshing state... [id=S3RedTeamScanner]
aws_s3_bucket_ownership_controls.public_log_ownership: Refreshing state... [id=cyb611-insecure-public-rw-logs-8p8ia2]
aws_s3_bucket_public_access_block.iam_unsafe: Refreshing state... [id=cyb611-insecure-iam-mc0f2k]
aws_s3_bucket_ownership_controls.iam_ownership: Refreshing state... [id=cyb611-insecure-iam-mc0f2k]
aws_s3_bucket_versioning.iam_versioning: Refreshing state... [id=cyb611-insecure-iam-mc0f2k]
aws_s3_bucket_acl.public_acl: Refreshing state... [id=cyb611-insecure-public-rw-8p8ia2,public-read]
aws_s3_bucket_cors_configuration.cors_config: Refreshing state... [id=cyb611-insecure-misconfigured-mpn9cb]
aws_s3_bucket_versioning.versioning: Refreshing state... [id=cyb611-insecure-misconfigured-mpn9cb]
aws_s3_bucket_ownership_controls.ownership: Refreshing state... [id=cyb611-insecure-misconfigured-mpn9cb]
aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=cyb611-insecure-misconfigured-mpn9cb]
aws_s3_bucket_policy.iam_policy: Refreshing state... [id=cyb611-insecure-iam-mc0f2k]
aws_s3_bucket_ownership_controls.iam_log_ownership: Refreshing state... [id=cyb611-insecure-iam-logs-mc0f2k]
aws_s3_bucket_acl.public_log_acl: Refreshing state... [id=cyb611-insecure-public-rw-logs-8p8ia2,log-delivery-write]
aws_s3_bucket_logging.iam_logging: Refreshing state... [id=cyb611-insecure-iam-mc0f2k]
aws_lambda_function_url.scanner: Refreshing state... [id=S3SecurityScanner]
aws_lambda_function_url.attacker_url: Refreshing state... [id=S3RedTeamScanner]
aws_cloudtrail.main_trail: Refreshing state... [id=arn:aws:cloudtrail:us-east-2:151462990345:trail/cyb611-management-events-trail]
aws_s3_bucket_policy.trail_bucket_policy: Refreshing state... [id=cyb611-cloudtrail-logs-phish-bits-12345]
aws_s3_bucket_server_side_encryption_configuration.default_enc: Refreshing state... [id=cyb611-secure-9r3207]
aws_s3_bucket_public_access_block.block_public: Refreshing state... [id=cyb611-secure-9r3207]
aws_s3_bucket_versioning.secure_versioning: Refreshing state... [id=cyb611-secure-9r3207]
aws_s3_bucket_policy.enforce_ssl: Refreshing state... [id=cyb611-secure-9r3207]
aws_s3_bucket_ownership_controls.secure_ownership: Refreshing state... [id=cyb611-secure-9r3207]
aws_s3_object.sample_record: Refreshing state... [id=sensitive_data/mock_pii.csv]
aws_s3_bucket_policy.read_policy: Refreshing state... [id=cyb611-insecure-misconfigured-mpn9cb]
aws_s3_bucket_acl.iam_log_acl: Refreshing state... [id=cyb611-insecure-iam-logs-mc0f2k,log-delivery-write]
aws_s3_bucket_acl.bucket_acl: Refreshing state... [id=cyb611-insecure-misconfigured-mpn9cb,public-read]
aws_s3_bucket_logging.log_config: Refreshing state... [id=cyb611-secure-9r3207]
aws_s3_bucket_ownership_controls.log_ownership: Refreshing state... [id=cyb611-secure-logs-9r3207]
aws_s3_object.dataset_upload: Refreshing state... [id=sensitive_data/mock_pii.csv]
aws_s3_bucket_acl.log_acl: Refreshing state... [id=cyb611-secure-logs-9r3207,log-delivery-write]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_s3_bucket.enc_bucket will be created
  + resource "aws_s3_bucket" "enc_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "Insecure No Encryption"
        }
      + tags_all                    = {
          + "Name" = "Insecure No Encryption"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket.enc_logs will be created
  + resource "aws_s3_bucket" "enc_logs" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket.legacy_data will be destroyed
  # (because aws_s3_bucket.legacy_data is not in configuration)
  - resource "aws_s3_bucket" "legacy_data" {
      - arn                         = "arn:aws:s3:::cyb611-insecure-no-encryption-vhvg8z" -> null
      - bucket                      = "cyb611-insecure-no-encryption-vhvg8z" -> null
      - bucket_domain_name          = "cyb611-insecure-no-encryption-vhvg8z.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "cyb611-insecure-no-encryption-vhvg8z.s3.us-east-2.amazonaws.com" -> null
      - force_destroy               = true -> null
      - hosted_zone_id              = "Z2O1EMRO9K5GLX" -> null
      - id                          = "cyb611-insecure-no-encryption-vhvg8z" -> null
      - object_lock_enabled         = false -> null
      - policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::cyb611-insecure-no-encryption-vhvg8z",
                          - "arn:aws:s3:::cyb611-insecure-no-encryption-vhvg8z/*",
                        ]
                      - Sid       = "DenyInsecureTransport"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - region                      = "us-east-2" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "Name" = "Insecure No Encryption"
        } -> null
      - tags_all                    = {
          - "Name" = "Insecure No Encryption"
        } -> null
        # (2 unchanged attributes hidden)

      - grant {
          - id          = "0f0243f6e46bda888422b63fa362aae67555594febccc1b35c7d2751eb32aaab" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      - logging {
          - target_bucket = "cyb611-insecure-no-encryption-logs-vhvg8z" -> null
          - target_prefix = "log/" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket.legacy_logs will be destroyed
  # (because aws_s3_bucket.legacy_logs is not in configuration)
  - resource "aws_s3_bucket" "legacy_logs" {
      - arn                         = "arn:aws:s3:::cyb611-insecure-no-encryption-logs-vhvg8z" -> null
      - bucket                      = "cyb611-insecure-no-encryption-logs-vhvg8z" -> null
      - bucket_domain_name          = "cyb611-insecure-no-encryption-logs-vhvg8z.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "cyb611-insecure-no-encryption-logs-vhvg8z.s3.us-east-2.amazonaws.com" -> null
      - force_destroy               = true -> null
      - hosted_zone_id              = "Z2O1EMRO9K5GLX" -> null
      - id                          = "cyb611-insecure-no-encryption-logs-vhvg8z" -> null
      - object_lock_enabled         = false -> null
      - region                      = "us-east-2" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null
        # (3 unchanged attributes hidden)

      - grant {
            id          = null
          - permissions = [
              - "READ_ACP",
              - "WRITE",
            ] -> null
          - type        = "Group" -> null
          - uri         = "http://acs.amazonaws.com/groups/s3/LogDelivery" -> null
        }
      - grant {
          - id          = "0f0243f6e46bda888422b63fa362aae67555594febccc1b35c7d2751eb32aaab" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket.public_assets will be destroyed
  # (because aws_s3_bucket.public_assets is not in configuration)
  - resource "aws_s3_bucket" "public_assets" {
      - arn                         = "arn:aws:s3:::cyb611-insecure-public-rw-8p8ia2" -> null
      - bucket                      = "cyb611-insecure-public-rw-8p8ia2" -> null
      - bucket_domain_name          = "cyb611-insecure-public-rw-8p8ia2.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "cyb611-insecure-public-rw-8p8ia2.s3.us-east-2.amazonaws.com" -> null
      - force_destroy               = true -> null
      - hosted_zone_id              = "Z2O1EMRO9K5GLX" -> null
      - id                          = "cyb611-insecure-public-rw-8p8ia2" -> null
      - object_lock_enabled         = false -> null
      - region                      = "us-east-2" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "Name" = "Insecure Public RW"
        } -> null
      - tags_all                    = {
          - "Name" = "Insecure Public RW"
        } -> null
        # (3 unchanged attributes hidden)

      - grant {
            id          = null
          - permissions = [
              - "READ",
            ] -> null
          - type        = "Group" -> null
          - uri         = "http://acs.amazonaws.com/groups/global/AllUsers" -> null
        }
      - grant {
          - id          = "0f0243f6e46bda888422b63fa362aae67555594febccc1b35c7d2751eb32aaab" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      - logging {
          - target_bucket = "cyb611-insecure-public-rw-logs-8p8ia2" -> null
          - target_prefix = "log/" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket.public_bucket will be created
  + resource "aws_s3_bucket" "public_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "cyb611-insecure-public-rw-8p8ia2"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "Insecure Public RW"
        }
      + tags_all                    = {
          + "Name" = "Insecure Public RW"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_acl.enc_log_acl will be created
  + resource "aws_s3_bucket_acl" "enc_log_acl" {
      + acl    = "log-delivery-write"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy (known after apply)
    }

  # aws_s3_bucket_acl.legacy_log_acl will be destroyed
  # (because aws_s3_bucket_acl.legacy_log_acl is not in configuration)
  - resource "aws_s3_bucket_acl" "legacy_log_acl" {
      - acl                   = "log-delivery-write" -> null
      - bucket                = "cyb611-insecure-no-encryption-logs-vhvg8z" -> null
      - id                    = "cyb611-insecure-no-encryption-logs-vhvg8z,log-delivery-write" -> null
        # (1 unchanged attribute hidden)

      - access_control_policy {
          - grant {
              - permission = "READ_ACP" -> null

              - grantee {
                    id            = null
                  - type          = "Group" -> null
                  - uri           = "http://acs.amazonaws.com/groups/s3/LogDelivery" -> null
                    # (2 unchanged attributes hidden)
                }
            }
          - grant {
              - permission = "WRITE" -> null

              - grantee {
                    id            = null
                  - type          = "Group" -> null
                  - uri           = "http://acs.amazonaws.com/groups/s3/LogDelivery" -> null
                    # (2 unchanged attributes hidden)
                }
            }
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - id            = "0f0243f6e46bda888422b63fa362aae67555594febccc1b35c7d2751eb32aaab" -> null
                  - type          = "CanonicalUser" -> null
                    # (3 unchanged attributes hidden)
                }
            }
          - owner {
              - id           = "0f0243f6e46bda888422b63fa362aae67555594febccc1b35c7d2751eb32aaab" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_bucket_acl.public_acl must be replaced
-/+ resource "aws_s3_bucket_acl" "public_acl" {
      ~ bucket                = "cyb611-insecure-public-rw-8p8ia2" -> (known after apply) # forces replacement
      ~ id                    = "cyb611-insecure-public-rw-8p8ia2,public-read" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ access_control_policy (known after apply)
      - access_control_policy {
          - grant {
              - permission = "READ" -> null

              - grantee {
                    id            = null
                  - type          = "Group" -> null
                  - uri           = "http://acs.amazonaws.com/groups/global/AllUsers" -> null
                    # (2 unchanged attributes hidden)
                }
            }
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - id            = "0f0243f6e46bda888422b63fa362aae67555594febccc1b35c7d2751eb32aaab" -> null
                  - type          = "CanonicalUser" -> null
                    # (3 unchanged attributes hidden)
                }
            }
          - owner {
              - id           = "0f0243f6e46bda888422b63fa362aae67555594febccc1b35c7d2751eb32aaab" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_bucket_logging.enc_logging will be created
  + resource "aws_s3_bucket_logging" "enc_logging" {
      + bucket        = (known after apply)
      + id            = (known after apply)
      + target_bucket = (known after apply)
      + target_prefix = "log/"
    }

  # aws_s3_bucket_logging.legacy_logging_config will be destroyed
  # (because aws_s3_bucket_logging.legacy_logging_config is not in configuration)
  - resource "aws_s3_bucket_logging" "legacy_logging_config" {
      - bucket                = "cyb611-insecure-no-encryption-vhvg8z" -> null
      - id                    = "cyb611-insecure-no-encryption-vhvg8z" -> null
      - target_bucket         = "cyb611-insecure-no-encryption-logs-vhvg8z" -> null
      - target_prefix         = "log/" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_s3_bucket_logging.public_logging will be created
  + resource "aws_s3_bucket_logging" "public_logging" {
      + bucket        = (known after apply)
      + id            = (known after apply)
      + target_bucket = "cyb611-insecure-public-rw-logs-8p8ia2"
      + target_prefix = "log/"
    }

  # aws_s3_bucket_logging.public_logging_config will be destroyed
  # (because aws_s3_bucket_logging.public_logging_config is not in configuration)
  - resource "aws_s3_bucket_logging" "public_logging_config" {
      - bucket                = "cyb611-insecure-public-rw-8p8ia2" -> null
      - id                    = "cyb611-insecure-public-rw-8p8ia2" -> null
      - target_bucket         = "cyb611-insecure-public-rw-logs-8p8ia2" -> null
      - target_prefix         = "log/" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_s3_bucket_ownership_controls.enc_log_ownership will be created
  + resource "aws_s3_bucket_ownership_controls" "enc_log_ownership" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # aws_s3_bucket_ownership_controls.enc_ownership will be created
  + resource "aws_s3_bucket_ownership_controls" "enc_ownership" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerEnforced"
        }
    }

  # aws_s3_bucket_ownership_controls.legacy_log_ownership will be destroyed
  # (because aws_s3_bucket_ownership_controls.legacy_log_ownership is not in configuration)
  - resource "aws_s3_bucket_ownership_controls" "legacy_log_ownership" {
      - bucket = "cyb611-insecure-no-encryption-logs-vhvg8z" -> null
      - id     = "cyb611-insecure-no-encryption-logs-vhvg8z" -> null

      - rule {
          - object_ownership = "BucketOwnerPreferred" -> null
        }
    }

  # aws_s3_bucket_ownership_controls.legacy_ownership will be destroyed
  # (because aws_s3_bucket_ownership_controls.legacy_ownership is not in configuration)
  - resource "aws_s3_bucket_ownership_controls" "legacy_ownership" {
      - bucket = "cyb611-insecure-no-encryption-vhvg8z" -> null
      - id     = "cyb611-insecure-no-encryption-vhvg8z" -> null

      - rule {
          - object_ownership = "BucketOwnerEnforced" -> null
        }
    }

  # aws_s3_bucket_ownership_controls.public_ownership must be replaced
-/+ resource "aws_s3_bucket_ownership_controls" "public_ownership" {
      ~ bucket = "cyb611-insecure-public-rw-8p8ia2" -> (known after apply) # forces replacement
      ~ id     = "cyb611-insecure-public-rw-8p8ia2" -> (known after apply)

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket_policy.enc_ssl_policy will be created
  + resource "aws_s3_bucket_policy" "enc_ssl_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_policy.legacy_ssl_policy will be destroyed
  # (because aws_s3_bucket_policy.legacy_ssl_policy is not in configuration)
  - resource "aws_s3_bucket_policy" "legacy_ssl_policy" {
      - bucket = "cyb611-insecure-no-encryption-vhvg8z" -> null
      - id     = "cyb611-insecure-no-encryption-vhvg8z" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::cyb611-insecure-no-encryption-vhvg8z",
                          - "arn:aws:s3:::cyb611-insecure-no-encryption-vhvg8z/*",
                        ]
                      - Sid       = "DenyInsecureTransport"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
    }

  # aws_s3_bucket_public_access_block.enc_block will be created
  + resource "aws_s3_bucket_public_access_block" "enc_block" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_public_access_block.legacy_block will be destroyed
  # (because aws_s3_bucket_public_access_block.legacy_block is not in configuration)
  - resource "aws_s3_bucket_public_access_block" "legacy_block" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "cyb611-insecure-no-encryption-vhvg8z" -> null
      - id                      = "cyb611-insecure-no-encryption-vhvg8z" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

  # aws_s3_bucket_public_access_block.public_block must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "public_block" {
      ~ bucket                  = "cyb611-insecure-public-rw-8p8ia2" -> (known after apply) # forces replacement
      ~ id                      = "cyb611-insecure-public-rw-8p8ia2" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_s3_bucket_server_side_encryption_configuration.iam_enc will be destroyed
  # (because aws_s3_bucket_server_side_encryption_configuration.iam_enc is not in configuration)
  - resource "aws_s3_bucket_server_side_encryption_configuration" "iam_enc" {
      - bucket                = "cyb611-insecure-iam-mc0f2k" -> null
      - id                    = "cyb611-insecure-iam-mc0f2k" -> null
        # (1 unchanged attribute hidden)

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - sse_algorithm     = "AES256" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_bucket_server_side_encryption_configuration.legacy_enc will be destroyed
  # (because aws_s3_bucket_server_side_encryption_configuration.legacy_enc is not in configuration)
  - resource "aws_s3_bucket_server_side_encryption_configuration" "legacy_enc" {
      - bucket                = "cyb611-insecure-no-encryption-vhvg8z" -> null
      - id                    = "cyb611-insecure-no-encryption-vhvg8z" -> null
        # (1 unchanged attribute hidden)

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - sse_algorithm     = "AES256" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_bucket_server_side_encryption_configuration.public_enc will be destroyed
  # (because aws_s3_bucket_server_side_encryption_configuration.public_enc is not in configuration)
  - resource "aws_s3_bucket_server_side_encryption_configuration" "public_enc" {
      - bucket                = "cyb611-insecure-public-rw-8p8ia2" -> null
      - id                    = "cyb611-insecure-public-rw-8p8ia2" -> null
        # (1 unchanged attribute hidden)

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - sse_algorithm     = "AES256" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_bucket_versioning.enc_versioning will be created
  + resource "aws_s3_bucket_versioning" "enc_versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_s3_bucket_versioning.legacy_versioning will be destroyed
  # (because aws_s3_bucket_versioning.legacy_versioning is not in configuration)
  - resource "aws_s3_bucket_versioning" "legacy_versioning" {
      - bucket                = "cyb611-insecure-no-encryption-vhvg8z" -> null
      - id                    = "cyb611-insecure-no-encryption-vhvg8z" -> null
        # (1 unchanged attribute hidden)

      - versioning_configuration {
          - status     = "Enabled" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # aws_s3_bucket_versioning.public_versioning must be replaced
-/+ resource "aws_s3_bucket_versioning" "public_versioning" {
      ~ bucket                = "cyb611-insecure-public-rw-8p8ia2" -> (known after apply) # forces replacement
      ~ id                    = "cyb611-insecure-public-rw-8p8ia2" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ versioning_configuration {
          + mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # aws_s3_object.archive_file will be destroyed
  # (because aws_s3_object.archive_file is not in configuration)
  - resource "aws_s3_object" "archive_file" {
      - arn                           = "arn:aws:s3:::cyb611-insecure-no-encryption-vhvg8z/sensitive_data/mock_pii.csv" -> null
      - bucket                        = "cyb611-insecure-no-encryption-vhvg8z" -> null
      - bucket_key_enabled            = false -> null
      - content                       = <<-EOT
            id,secret
            1,UnencryptedData
        EOT -> null
      - content_type                  = "text/csv" -> null
      - etag                          = "19ac515d5851eb0b2a0c38b6bd56a953" -> null
      - force_destroy                 = false -> null
      - id                            = "sensitive_data/mock_pii.csv" -> null
      - key                           = "sensitive_data/mock_pii.csv" -> null
      - metadata                      = {} -> null
      - server_side_encryption        = "AES256" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {} -> null
      - tags_all                      = {} -> null
      - version_id                    = "null" -> null
        # (13 unchanged attributes hidden)
    }

  # aws_s3_object.enc_file will be created
  + resource "aws_s3_object" "enc_file" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content                = <<-EOT
            id,secret
            1,UnencryptedData
        EOT
      + content_type           = "text/csv"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "sensitive_data/mock_pii.csv"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.iam_config will be destroyed
  # (because aws_s3_object.iam_config is not in configuration)
  - resource "aws_s3_object" "iam_config" {
      - arn                           = "arn:aws:s3:::cyb611-insecure-iam-mc0f2k/sensitive_data/mock_pii.csv" -> null
      - bucket                        = "cyb611-insecure-iam-mc0f2k" -> null
      - bucket_key_enabled            = false -> null
      - content                       = <<-EOT
            id,secret
            1,DevData
        EOT -> null
      - content_type                  = "text/csv" -> null
      - etag                          = "1fcc855d90d2824f99e15fff189456cd" -> null
      - force_destroy                 = false -> null
      - id                            = "sensitive_data/mock_pii.csv" -> null
      - key                           = "sensitive_data/mock_pii.csv" -> null
      - metadata                      = {} -> null
      - server_side_encryption        = "AES256" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {} -> null
      - tags_all                      = {} -> null
      - version_id                    = "null" -> null
        # (13 unchanged attributes hidden)
    }

  # aws_s3_object.iam_file will be created
  + resource "aws_s3_object" "iam_file" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "cyb611-insecure-iam-mc0f2k"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content                = <<-EOT
            id,secret
            1,DevData
        EOT
      + content_type           = "text/csv"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "sensitive_data/mock_pii.csv"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.public_file will be created
  + resource "aws_s3_object" "public_file" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content                = <<-EOT
            id,secret
            1,PublicData
        EOT
      + content_type           = "text/csv"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "sensitive_data/mock_pii.csv"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.web_asset will be destroyed
  # (because aws_s3_object.web_asset is not in configuration)
  - resource "aws_s3_object" "web_asset" {
      - arn                           = "arn:aws:s3:::cyb611-insecure-public-rw-8p8ia2/sensitive_data/mock_pii.csv" -> null
      - bucket                        = "cyb611-insecure-public-rw-8p8ia2" -> null
      - bucket_key_enabled            = false -> null
      - content                       = <<-EOT
            id,secret
            1,PublicData
        EOT -> null
      - content_type                  = "text/csv" -> null
      - etag                          = "b81a2d403dd01b224f6068e6c7efee1a" -> null
      - force_destroy                 = false -> null
      - id                            = "sensitive_data/mock_pii.csv" -> null
      - key                           = "sensitive_data/mock_pii.csv" -> null
      - metadata                      = {} -> null
      - server_side_encryption        = "AES256" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {} -> null
      - tags_all                      = {} -> null
      - version_id                    = "Y9IGE_gRJXzG6omJ_41LYiqBgOXPhrS3" -> null
        # (13 unchanged attributes hidden)
    }

  # random_string.enc_id will be created
  + resource "random_string" "enc_id" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # random_string.legacy_id will be destroyed
  # (because random_string.legacy_id is not in configuration)
  - resource "random_string" "legacy_id" {
      - id          = "vhvg8z" -> null
      - length      = 6 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "vhvg8z" -> null
      - special     = false -> null
      - upper       = false -> null
    }

Plan: 19 to add, 0 to change, 22 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```